CV/main.org
#+OPTIONS: title:nil author:nil date:nil toc:nil num:nil
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [letterpaper,11pt]
#+LATEX_COMPILER: xelatex
#+LATEX_HEADER: \usepackage{latexsym}
#+LATEX_HEADER: \usepackage[empty]{fullpage}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \usepackage{marvosym}
#+LATEX_HEADER: \usepackage[usenames,dvipsnames]{color}
#+LATEX_HEADER: \usepackage{verbatim}
#+LATEX_HEADER: \usepackage{enumitem}
#+LATEX_HEADER: \hypersetup{hidelinks}
#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{hyphenat}
#+LATEX_HEADER: \pagestyle{fancy}
#+LATEX_HEADER: \fancyhf{}
#+LATEX_HEADER: \fancyfoot{}
#+LATEX_HEADER: \renewcommand{\headrulewidth}{0pt}
#+LATEX_HEADER: \renewcommand{\footrulewidth}{0pt}
#+LATEX_HEADER: \addtolength{\oddsidemargin}{-0.5in}
#+LATEX_HEADER: \addtolength{\evensidemargin}{-0.5in}
#+LATEX_HEADER: \addtolength{\textwidth}{1in}
#+LATEX_HEADER: \addtolength{\topmargin}{-.5in}
#+LATEX_HEADER: \addtolength{\textheight}{1.0in}
#+LATEX_HEADER: \setlength{\footskip}{8pt}
#+LATEX_HEADER: \urlstyle{same}
#+LATEX_HEADER: \raggedbottom
#+LATEX_HEADER: \raggedright
#+LATEX_HEADER: \setlength{\tabcolsep}{0in}
#+LATEX_HEADER: \titleformat{\section}{\vspace{-4pt}\scshape\raggedright\large}{}{0em}{}[\color{black}\titlerule \vspace{-5pt}]
#+LATEX_HEADER: \newcommand{\resumeItem}[1]{\item\small{{#1 \vspace{-2pt}}}}
#+LATEX_HEADER: \newcommand{\resumeSubheading}[4]{\vspace{-2pt}\item\begin{tabular*}{0.97\textwidth}[t]{l@{\extracolsep{\fill}}r}\textbf{#1} & #2 \\\textit{\small#3} & \textit{\small #4} \\\end{tabular*}\vspace{-7pt}}
#+LATEX_HEADER: \newcommand{\resumeSubSubheading}[2]{\vspace{-2pt}\item\begin{tabular*}{0.97\textwidth}{l@{\extracolsep{\fill}}r}\textit{\small#1} & \textit{\small #2} \\\end{tabular*}\vspace{-7pt}}
#+LATEX_HEADER: \newcommand{\resumeEducationHeading}[6]{\vspace{-2pt}\item\begin{tabular*}{0.97\textwidth}[t]{l@{\extracolsep{\fill}}r}\textbf{#1} & #2 \\\textit{\small#3} & \textit{\small #4} \\\textit{\small#5} & \textit{\small #6} \\\end{tabular*}\vspace{-5pt}}
#+LATEX_HEADER: \newcommand{\resumeProjectHeading}[2]{\vspace{-2pt}\item\begin{tabular*}{0.97\textwidth}{l@{\extracolsep{\fill}}r}\small#1 & #2 \\\end{tabular*}\vspace{-7pt}}
#+LATEX_HEADER: \newcommand{\resumeOrganizationHeading}[4]{\vspace{-2pt}\item\begin{tabular*}{0.97\textwidth}[t]{l@{\extracolsep{\fill}}r}\textbf{#1} & \textit{\small #2} \\\textit{\small#3}\end{tabular*}\vspace{-7pt}}
#+LATEX_HEADER: \newcommand{\resumeSubItem}[1]{\resumeItem{#1}\vspace{-4pt}}
#+LATEX_HEADER: \renewcommand\labelitemii{$\vcenter{\hbox{\tiny$\bullet$}}$}
#+LATEX_HEADER: \newcommand{\resumeSubHeadingListStart}{\begin{itemize}[leftmargin=0.15in, label={}]}
#+LATEX_HEADER: \newcommand{\resumeSubHeadingListEnd}{\end{itemize}}
#+LATEX_HEADER: \newcommand{\resumeItemListStart}{\begin{itemize}}
#+LATEX_HEADER: \newcommand{\resumeItemListEnd}{\end{itemize}\vspace{-5pt}}

#+begin_export latex
\begin{center}
    \textbf{\Huge \scshape Aaron He} \\ \vspace{3pt}
    \small
    \href{mailto:aaron.he@student.unsw.edu.au}{aaron.he@student.unsw.edu.au}
    $|$
    \href{https://github.com/AaronHnoraA}{github.com/AaronHnoraA}
    $|$
    Sydney, Australia
\end{center}
#+end_export

* Education
#+begin_export latex
\vspace{3pt}
\resumeSubHeadingListStart

  \resumeEducationHeading
    {University of New South Wales (UNSW)}{Sydney, Australia}
    {Undergraduate, School of Mathematics and Statistics}{Current}
    {Talented Students Program}{}
    \resumeSubHeadingListStart
    \small{\item{
      \textbf{Academic supervision:} Youming Qiao.}}
    \resumeSubHeadingListEnd

\resumeSubHeadingListEnd
#+end_export

* Research Interests
#+begin_export latex
\vspace{2pt}
\resumeSubHeadingListStart
  \small{\item{
    \textbf{Quantum computing:} quantum states, observables, density operators, measurement, and the linear-algebraic foundations behind them. \\ \vspace{3pt}
    \textbf{Mathematics:} linear algebra, inner product spaces, Hilbert spaces, Hermitian operators, and related algebraic structure. \\ \vspace{3pt}
    \textbf{Theoretical computer science:} long-term interest in complexity theory, algorithms, and communication complexity. \\ \vspace{3pt}
  }}
\resumeSubHeadingListEnd
#+end_export

* Selected Writing
#+begin_export latex
\vspace{3pt}
\resumeSubHeadingListStart

  \resumeProjectHeading
    {\textbf{Quantum State} $|$ \emph{\href{roam/QC/quantum_state.html}{published note}}}{2026}
    \resumeItemListStart
      \resumeItem{Expository note on the Hilbert-space model of quantum states, including the distinction between state vectors and rays.}
    \resumeItemListEnd

  \resumeProjectHeading
    {\textbf{Observable \& Expectation} $|$ \emph{\href{roam/QC/observable_expectation.html}{published note}}}{2026}
    \resumeItemListStart
      \resumeItem{Short note explaining why observables are modeled by Hermitian operators and how expectation values arise from the spectral viewpoint.}
    \resumeItemListEnd

  \resumeProjectHeading
    {\textbf{Density Operator} $|$ \emph{\href{roam/QC/density_operator.html}{published note}}}{2026}
    \resumeItemListStart
      \resumeItem{Write-up on mixed states, positivity, trace normalization, and the role of density operators in unifying expectation formulas.}
    \resumeItemListEnd

  \resumeProjectHeading
    {\textbf{Hilbert Space / Inner Product Space / Hermitian Matrix} $|$ \emph{\href{roam/math/hilbert_space.html}{published notes}}}{2026}
    \resumeItemListStart
      \resumeItem{Foundational notes on inner product spaces, Hilbert spaces, and Hermitian matrices written as supporting material for quantum computing study.}
    \resumeItemListEnd

\resumeSubHeadingListEnd
#+end_export

* Projects
#+begin_export latex
\vspace{2pt}
\resumeSubHeadingListStart
  \resumeProjectHeading
    {\textbf{Personal Mathematics Website and Open Notebook}}{2026}
    \resumeItemListStart
      \resumeItem{Maintains a personal website generated from Org source files with Emacs `org-publish', including a searchable archive and a browsable knowledge graph of notes.}
    \resumeItemListEnd

  \resumeProjectHeading
    {\textbf{Org-based Writing and Export Workflow}}{2026}
    \resumeItemListStart
      \resumeItem{Uses Emacs, Org Mode, LaTeX, and `latexmk --xelatex' to keep note-taking, mathematical writing, PDF generation, and web publishing in a single workflow.}
    \resumeItemListEnd

  \resumeProjectHeading
    {\textbf{Structured Quantum Computing Notes}}{2026}
    \resumeItemListStart
      \resumeItem{Builds a connected set of notes on quantum states, observables, expectation values, density operators, and related linear algebra, intended both for study and public reference.}
    \resumeItemListEnd

\resumeSubHeadingListEnd
#+end_export

* Technical Profile
#+begin_export latex
\vspace{2pt}
\resumeSubHeadingListStart
  \small{\item{
    \textbf{Mathematical writing:}{ LaTeX, XeLaTeX, Org Mode.} \\ \vspace{3pt}
    \textbf{Publishing workflow:}{ Emacs, org-publish, latexmk, HTML/CSS, JavaScript.} \\ \vspace{3pt}
    \textbf{Working areas:}{ note-taking systems, mathematical exposition, lightweight static-site publishing, and research-oriented study workflows.}
  }}
\resumeSubHeadingListEnd
#+end_export
