CV/main.tex
% Created 2026-04-27 Mon 15:00
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper,11pt]{article}

\usepackage{amsmath}
\usepackage{fontspec}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{latexsym}
\usepackage[empty]{fullpage}
\usepackage{titlesec}
\usepackage{marvosym}
\usepackage[usenames,dvipsnames]{color}
\usepackage{verbatim}
\usepackage{enumitem}
\hypersetup{hidelinks}
\usepackage{fancyhdr}
\usepackage[english]{babel}
\usepackage{tabularx}
\usepackage{hyphenat}
\pagestyle{fancy}
\fancyhf{}
\fancyfoot{}
\renewcommand{\headrulewidth}{0pt}
\renewcommand{\footrulewidth}{0pt}
\addtolength{\oddsidemargin}{-0.5in}
\addtolength{\evensidemargin}{-0.5in}
\addtolength{\textwidth}{1in}
\addtolength{\topmargin}{-.5in}
\addtolength{\textheight}{1.0in}
\setlength{\footskip}{8pt}
\urlstyle{same}
\raggedbottom
\raggedright
\setlength{\tabcolsep}{0in}
\titleformat{\section}{\vspace{-4pt}\scshape\raggedright\large}{}{0em}{}[\color{black}\titlerule \vspace{-5pt}]
\newcommand{\resumeItem}[1]{\item\small{{#1 \vspace{-2pt}}}}
\newcommand{\resumeSubheading}[4]{\vspace{-2pt}\item\begin{tabular*}{0.97\textwidth}[t]{l@{\extracolsep{\fill}}r}\textbf{#1} & #2 \\\textit{\small#3} & \textit{\small #4} \\\end{tabular*}\vspace{-7pt}}
\newcommand{\resumeSubSubheading}[2]{\vspace{-2pt}\item\begin{tabular*}{0.97\textwidth}{l@{\extracolsep{\fill}}r}\textit{\small#1} & \textit{\small #2} \\\end{tabular*}\vspace{-7pt}}
\newcommand{\resumeEducationHeading}[6]{\vspace{-2pt}\item\begin{tabular*}{0.97\textwidth}[t]{l@{\extracolsep{\fill}}r}\textbf{#1} & #2 \\\textit{\small#3} & \textit{\small #4} \\\textit{\small#5} & \textit{\small #6} \\\end{tabular*}\vspace{-5pt}}
\newcommand{\resumeProjectHeading}[2]{\vspace{-2pt}\item\begin{tabular*}{0.97\textwidth}{l@{\extracolsep{\fill}}r}\small#1 & #2 \\\end{tabular*}\vspace{-7pt}}
\newcommand{\resumeOrganizationHeading}[4]{\vspace{-2pt}\item\begin{tabular*}{0.97\textwidth}[t]{l@{\extracolsep{\fill}}r}\textbf{#1} & \textit{\small #2} \\\textit{\small#3}\end{tabular*}\vspace{-7pt}}
\newcommand{\resumeSubItem}[1]{\resumeItem{#1}\vspace{-4pt}}
\renewcommand\labelitemii{$\vcenter{\hbox{\tiny$\bullet$}}$}
\newcommand{\resumeSubHeadingListStart}{\begin{itemize}[leftmargin=0.15in, label={}]}
\newcommand{\resumeSubHeadingListEnd}{\end{itemize}}
\newcommand{\resumeItemListStart}{\begin{itemize}}
\newcommand{\resumeItemListEnd}{\end{itemize}\vspace{-5pt}}
\date{}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={},
 pdflang={English}}
\begin{document}

\begin{center}
    \textbf{\Huge \scshape Aaron He} \\ \vspace{3pt}
    \small
    \href{mailto:aaron.he@student.unsw.edu.au}{aaron.he@student.unsw.edu.au}
    $|$
    \href{https://github.com/AaronHnoraA}{github.com/AaronHnoraA}
    $|$
    Sydney, Australia
\end{center}
\section*{Education}
\label{sec:org1ef53d2}
\vspace{3pt}
\resumeSubHeadingListStart

  \resumeEducationHeading
    {University of New South Wales (UNSW)}{Sydney, Australia}
    {Undergraduate, School of Mathematics and Statistics}{Current}
    {Talented Students Program}{}
    \resumeSubHeadingListStart
    \small{\item{
      \textbf{Academic supervision:} Youming Qiao.}}
    \resumeSubHeadingListEnd

\resumeSubHeadingListEnd
\section*{Research Interests}
\label{sec:orge2e1d50}
\vspace{2pt}
\resumeSubHeadingListStart
  \small{\item{
    \textbf{Quantum computing:} quantum states, observables, density operators, measurement, and the linear-algebraic foundations behind them. \\ \vspace{3pt}
    \textbf{Mathematics:} linear algebra, inner product spaces, Hilbert spaces, Hermitian operators, and related algebraic structure. \\ \vspace{3pt}
    \textbf{Theoretical computer science:} long-term interest in complexity theory, algorithms, and communication complexity. \\ \vspace{3pt}
  }}
\resumeSubHeadingListEnd
\section*{Selected Writing}
\label{sec:org418fefb}
\vspace{3pt}
\resumeSubHeadingListStart

  \resumeProjectHeading
    {\textbf{Quantum State} $|$ \emph{\href{roam/QC/quantum_state.html}{published note}}}{2026}
    \resumeItemListStart
      \resumeItem{Expository note on the Hilbert-space model of quantum states, including the distinction between state vectors and rays.}
    \resumeItemListEnd

  \resumeProjectHeading
    {\textbf{Observable \& Expectation} $|$ \emph{\href{roam/QC/observable_expectation.html}{published note}}}{2026}
    \resumeItemListStart
      \resumeItem{Short note explaining why observables are modeled by Hermitian operators and how expectation values arise from the spectral viewpoint.}
    \resumeItemListEnd

  \resumeProjectHeading
    {\textbf{Density Operator} $|$ \emph{\href{roam/QC/density_operator.html}{published note}}}{2026}
    \resumeItemListStart
      \resumeItem{Write-up on mixed states, positivity, trace normalization, and the role of density operators in unifying expectation formulas.}
    \resumeItemListEnd

  \resumeProjectHeading
    {\textbf{Hilbert Space / Inner Product Space / Hermitian Matrix} $|$ \emph{\href{roam/math/hilbert_space.html}{published notes}}}{2026}
    \resumeItemListStart
      \resumeItem{Foundational notes on inner product spaces, Hilbert spaces, and Hermitian matrices written as supporting material for quantum computing study.}
    \resumeItemListEnd

\resumeSubHeadingListEnd
\section*{Projects}
\label{sec:org09e3048}
\vspace{2pt}
\resumeSubHeadingListStart
  \resumeProjectHeading
    {\textbf{Personal Mathematics Website and Open Notebook}}{2026}
    \resumeItemListStart
      \resumeItem{Maintains a personal website generated from Org source files with Emacs `org-publish', including a searchable archive and a browsable knowledge graph of notes.}
    \resumeItemListEnd

  \resumeProjectHeading
    {\textbf{Org-based Writing and Export Workflow}}{2026}
    \resumeItemListStart
      \resumeItem{Uses Emacs, Org Mode, LaTeX, and `latexmk --xelatex' to keep note-taking, mathematical writing, PDF generation, and web publishing in a single workflow.}
    \resumeItemListEnd

  \resumeProjectHeading
    {\textbf{Structured Quantum Computing Notes}}{2026}
    \resumeItemListStart
      \resumeItem{Builds a connected set of notes on quantum states, observables, expectation values, density operators, and related linear algebra, intended both for study and public reference.}
    \resumeItemListEnd

\resumeSubHeadingListEnd
\section*{Technical Profile}
\label{sec:org53bc2dc}
\vspace{2pt}
\resumeSubHeadingListStart
  \small{\item{
    \textbf{Mathematical writing:}{ LaTeX, XeLaTeX, Org Mode.} \\ \vspace{3pt}
    \textbf{Publishing workflow:}{ Emacs, org-publish, latexmk, HTML/CSS, JavaScript.} \\ \vspace{3pt}
    \textbf{Working areas:}{ note-taking systems, mathematical exposition, lightweight static-site publishing, and research-oriented study workflows.}
  }}
\resumeSubHeadingListEnd
\end{document}
